# -*- coding: utf-8 -*-
"""homework.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1D3bprl66peU-mxebTLbzdi6a4oDCTfTD

### №1. Степени двойки.

Теперь выведите все степени двойки в диапазоне от [l, r]* включительно

*r - теперь может принимать большие значения. Оптимизируйте свой код.

Входные данные:

$1<=l<=r<=10^{10}$

Выведите все числа в одну строку через пробел.

```bash
9 512
```

```bash
16
32
64
128
256
512
```
"""

l, r=map(int, input().split())
numb=1
while numb<=r:
  if numb>=l:
    print(numb)
  numb *=2

"""### №2. Делители числа.
Выведите все делители числа от 1 до $n$ включительно.

Входные данные:
$1<=n<=10^7$

*Будьте аккуратны с квадратами

```bash
21
```
```bash
1 3 7 21
```
"""

n = int(input())

deliteli = []
for i in range(1, n + 1):
    if n % i == 0:
        deliteli.append(i)

print(*deliteli)

"""### №3. Високосный год.

По номеру года определите, является ли данный год високосным.

Напомним, что високосными являются года, номера которых кратны 4, но не кратны 100, а также года, номера которых кратны 400

Выведите `Да` или `Нет` в зависимости от ответа на вопрос задачи.

Входные данные:
```bash
2007
```

Результат:
```bash
Нет
```
"""

n=int(input())
if (n%4==0 and n%100!=0) or n%400==0:
  print('Да')
else:
  print('Нет')

"""### №4. Шахматы.

Поле шахматной доски определяется парой натуральных чисел, каждое из которых не превосходит 8.

По введенным координатам двух полей (𝑘,𝑙) и (𝑚,𝑛) выясните, угрожает ли ферзь, находящийся на поле (𝑘,𝑙), полю (𝑚,𝑛)?

Выведите `Да` или `Нет` в зависимости от ответа на вопрос задачи.

Входные данные:
```bash
1 1 2 2
```

Результат:
```bash
Да
```
"""

k=int(input())
l=int(input())
m=int(input())
n=int(input())
if (k + l + m + n) % 2 == 0:
  print('Да')
else:
  print('Нет')

"""### №5 k-ая секунда суток

Идёт 𝑘-я секунда суток. Определите, сколько целых часов ℎ и целых минут m прошло с начала суток. Например, если

$𝑘=13257=3⋅3600+40⋅60+57$

Входные данные:
```bash
13257
```

Результат:
```bash
3 hours 40 minutes
```
"""

k=int(input())
h=int(k/3600)
m=int(k%3600/60)
print(h, 'hours', m, 'minutes')

"""### №6 Елочка

Выведите елочку высоты $n$ по шаблону из примера

Входные данные:
```bash
3
```

Результат:
```bash
  *
 ***
*****
```
"""

n=int(input())
for i in range(n+1):
  print(' '*(n-i), end='')
  print('*'*(2*i-1))

"""### №7 Максимум и минимум

Дана последовательность, состоящая из $n$ чисел. Найти в ней максимум и минимум.

*Запрещено использование функций min и max


Входные данные - число $n > 0$ и числа на разных строчках $-1000 <= a_i <= 1000$:
```bash
3
5
6
7
```

Выходные данные:
```bash
5 7
```
"""

n=int(input())
min=1000
max=-1000
for i in range(n):
   x=int(input())
   if x > max:
       max=x
   if x < min:
       min=x
print(min,max)

"""### №8 Минимум и минимум

Дана последовательность, состоящая из $n$ чисел. Найти в ней два самых маленьких числа.

*Запрещено использование функций min и max

Входные данные - число $n > 0$ и числа на разных строчках $-1000 <= a_i <= 1000$:
```bash
3
5
6
7
```

Выходные данные:
```bash
5 6
```
"""

n=int(input())
min1=1000
min2=1000
for i in range(n):
   x=int(input())
   if x < min1:
       min1=x
   if x > min1 and x < min2:
       min2=x
print(min1,min2)