# -*- coding: utf-8 -*-
"""дз3.ipynb"

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1DcyVCPNkFImyf16Y-7O_DnNmZUQnCxZw

### №1. Swap

Найдите максимальный и минимальный элементы в массиве и поменяйте их местами.

Входные данные:

На вход программе сначала подается значение 𝑛 ≤ 100 — количество элементов в массиве. В следующей строке входных данных расположены сами элементы массива — целые числа.

```bash
5
1 5 4 3 2
```

Выведите все числа в одну строку через пробел.

```bash
5 1 4 3 2
```
"""

n = int(input())
massiv = list(map(int, input().split()))
min_index = 0
max_index = 0
for i in range(n):
    if massiv[i] < massiv[min_index]:
        min_index = i
    if massiv[i] > massiv[max_index]:
        max_index = i
massiv[min_index], massiv[max_index] = massiv[max_index], massiv[min_index]
print(*massiv)

"""### №2. Произведение.

В массиве, заполненном произвольными целыми числами, найдите два числа, произведение которых максимально. Вложенные циклы не используйте

Входные данные:

На вход программе сначала подается значение 𝑛≤100000 — количество элементов в массиве. В следующей строке входных данных расположены сами элементы массива - целые числа.

Выведите эти два числа

```bash
5
-4 3 -5 2 5
```
Ответ
```bash
-5 -4
```
"""

n = int(input())
a = list(map(int, input().split()))
a.sort()
max_index = max(a[-1] * a[-2], a[0] * a[1])
if a[-1] * a[-2] == max_index:
    print(a[-2], a[-1])
else:
    print(a[0], a[1])

"""### №3. Полиглоты.

Каждый из 𝑁 школьников некоторой школы знает 𝑀𝑖 языков. Определите, какие языки знают все школьники и языки, которые знает хотя бы один из школьников.

Входные данные
Первая строка входных данных содержит количество школьников 𝑁. Далее идет 𝑁 чисел 𝑀𝑖, после каждого из чисел идет 𝑀𝑖 строк, содержащих названия языков, которые знает 𝑖-й школьник. Длина названий языков не превышает 1000 символов, количество различных языков не более 1000. 1≤𝑁≤1000, 1≤𝑀𝑖≤500.

В первой строке выведите количество языков, которые знают все школьники. Начиная со второй строки - список таких языков. Затем - количество языков, которые знает хотя бы один школьник, на следующих строках - список таких языков.

Входные данные:
```bash
3
3
Russian
English
Japanese
2
Russian
English
1
English
```

Результат:
```bash
1
English
3
Russian
Japanese
English
```
"""

n = int(input())
all_languages = set()
common_languages = None
for _ in range(n):
    m = int(input())
    student_languages = set()
    for _ in range(m):
        lang = input()
        student_languages.add(lang)
        all_languages.add(lang)
    if common_languages is None:
        common_languages = student_languages
    else:
        common_languages = common_languages.intersection(student_languages)
print(len(common_languages))
for lang in sorted(list(common_languages)):
    print(lang)
print(len(all_languages))
for lang in sorted(list(all_languages)):
    print(lang)

"""### №4. Магазин.

Дана база данных о продажах некоторого интернет-магазина. Каждая строка входного файла представляет собой запись вида Покупатель товар количество, где Покупатель — имя покупателя (строка без пробелов), товар — название товара (строка без пробелов), количество — количество приобретенных единиц товара.

Создайте список всех покупателей, а для каждого покупателя подсчитайте количество приобретенных им единиц каждого вида товаров.

Входные данные:
```bash
6
Ivanov paper 10
Petrov pens 5
Ivanov marker 3
Ivanov paper 7
Petrov envelope 20
Ivanov envelope 5
```

Результат:
```bash
Ivanov:
envelope 5
marker 3
paper 17
Petrov:
envelope 20
pens 5
```
"""

n = int(input())
customers = {}
for _ in range(n):
    customer, item, quantity = input().split()
    quantity = int(quantity)
    if customer not in customers:
        customers[customer] = {}
    if item not in customers[customer]:
        customers[customer][item] = 0
    customers[customer][item] += quantity
for customer in sorted(customers.keys()):
    print(customer + ":")
    for item in sorted(customers[customer].keys()):
        print(item, customers[customer][item])

"""### №5 Посчитай повторы

Даны n строк. Выведите все слова, встречающиеся в строках, по одному на каждую строку. Слова должны быть отсортированы по убыванию их количества появления в тексте, а при одинаковой частоте появления — в лексикографическом порядке.

Указание. После того, как вы создадите словарь всех слов, вам захочется отсортировать его по частоте встречаемости слова. Желаемого можно добиться, если создать список, элементами которого будут кортежи из двух элементов: частота встречаемости слова и само слово. Например, [(2, 'hi'), (1, 'what'), (3, 'is')]. Тогда стандартная сортировка будет сортировать список кортежей, при этом кортежи сравниваются по первому элементу, а если они равны — то по второму. Это почти то, что требуется в задаче.

Входные данные:
```bash
9
hi
hi
what is your name
my name is bond
james bond
my name is damme
van damme
claude van damme
jean claude van damme
```

Результат:
```bash
damme
is
name
van
bond
claude
hi
my
james
jean
what
your
```
"""

n = int(input())
word_counts = {}
for _ in range(n):
    line = input().split()
    for word in line:
        word_counts[word] = word_counts.get(word, 0) + 1
sorted_words = sorted(word_counts.items(), key=lambda item: (-item[1], item[0]))
for word, count in sorted_words:
    print(word)

"""### №6 Угадай число

Август и Беатриса играют в игру. Август загадал натуральное число от 1 до n. Беатриса пытается угадать это число, для этого она называет некоторые множества натуральных чисел. Август отвечает Беатрисе YES, если среди названных ей чисел есть задуманное или NO в противном случае. После нескольких заданных вопросов Беатриса запуталась в том, какие вопросы она задавала и какие ответы получила и просит вас помочь ей определить, какие числа мог задумать Август.

Первая строка входных данных содержит число n — наибольшее число, которое мог загадать Август. Далее идут строки, содержащие вопросы Беатрисы. Каждая строка представляет собой набор чисел, разделенных пробелами. После каждой строки с вопросом идет ответ Августа: YES или NO.

Наконец, последняя строка входных данных содержит одно слово HELP.

Вы должны вывести (через пробел, в порядке возрастания) все числа, которые мог задумать Август.

Входные данные:
```bash
10
1 2 3 4 5
YES
2 4 6 8 10
NO
HELP
```

Результат:
```bash
1 3 5
```
"""

n = int(input())
possible_numbers = set(range(1, n + 1))
while True:
    line = input()
    if line == "HELP":
        break
    guess = set(map(int, line.split()))
    answer = input()
    if answer == "YES":
        possible_numbers.intersection_update(guess)
    else:
        possible_numbers.difference_update(guess)
print(*sorted(list(possible_numbers)))

"""### №7 Посчитай и проверь

На вход программе сначала подается значение 𝑛 ≤ 100 — количество элементов в массиве. В следующей строке входных данных расположены сами элементы массива — целые числа, по модулю не превосходящие 30000. Распечатайте только те значения элементов массива, которые встречаются в нем ровно один раз. Элементы следует распечатывать в том порядке, в котором они встречаются в массиве. Создавать новые массивы нельзя.



```bash
8
4 3 5 2 5 1 3 5
```

Выходные данные:
```bash
4 2 1
```

"""

n = int(input())
massiv = list(map(int, input().split()))
counts = {}
for x in massiv:
    counts[x] = counts.get(x, 0) + 1
for x in massiv:
    if counts[x] == 1:
        print(x, end=" ")